Revit 2024 API
PlumbingUtils.HasOpenConnector Method
 Checks if there is open piping connector for the given element - object of pipe curve, pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool HasOpenConnector(
	Document document,
	ElementId elemId
)
Visual Basic
Public Shared Function HasOpenConnector ( _
	document As Document, _
	elemId As ElementId _
) As Boolean
Visual C++
public:
static bool HasOpenConnector(
	Document^ document,
	ElementId^ elemId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
elemId
Type: Autodesk.Revit.DB.ElementId
 Element id to check.
Return Value
 True if given element has open piping connector, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PlumbingUtils Class
Autodesk.Revit.DB.Plumbing Namespace